package homework.homework18;
//Написать прогрпмму для парсинга xml документа.
//Программа на вход получает строку к папке, гдде находится документ.
// Распарсить нужно только один докумен - соответсвтенно,
//предусмотреть различные проверки, например на то, что в папке нет файлов,
//или в папке несколько документов формата xml и другие возможные проверки.
// необходимо распарсить xml документ и содержимое тегов line записать в другой документ
// название файла для записи должно состоять из значений тегов и имеет вид:
// <firstName>_<lastName>_<title>.txt
public class XmlExample {
    public static void main(String[] args) {

    }
}
